In [15]:
import pandas as pd

In [16]:
pop_10_19_clean = pd.read_csv('./clean_datasets/population-2010-2019.csv')
pop_20_29_clean = pd.read_csv('./clean_datasets/population-2020-2029.csv')
pop_30_39_clean = pd.read_csv('./clean_datasets/population-2030-2040.csv')

In [17]:
pop_10_19_clean.head()

   LocID             Location  Year AgeGrp   PopMale  PopFemale
0      4          Afghanistan     0    0-4  2715.070   2600.535
1      8              Albania     0    0-4    92.622     81.239
2     12              Algeria     0    0-4  1966.415   1885.869
3     24               Angola     0    0-4  2233.041   2239.035
4     28  Antigua and Barbuda     0    0-4     3.543      3.436

In [18]:
pop_20_29_clean.head()

   LocID             Location  Year AgeGrp   PopMale  PopFemale
0      4          Afghanistan  2020    0-4  2907.406   2765.103
1      8              Albania  2020    0-4    86.564     79.714
2     12              Algeria  2020    0-4  2574.062   2467.456
3     24               Angola  2020    0-4  2923.514   2871.490
4     28  Antigua and Barbuda  2020    0-4     3.730      3.625

In [19]:
pop_30_39_clean.head()

   LocID             Location  Year AgeGrp   PopMale  PopFemale
0      4          Afghanistan  2030    0-4  3020.571   2871.955
1      8              Albania  2030    0-4    68.824     63.581
2     12              Algeria  2030    0-4  2116.681   2026.749
3     24               Angola  2030    0-4  3714.206   3649.187
4     28  Antigua and Barbuda  2030    0-4     3.452      3.354

In [20]:
all_pop = pd.concat([pop_10_19_clean, pop_20_29_clean, pop_30_39_clean], ignore_index=True)

In [21]:
all_pop.head()

   LocID             Location  Year AgeGrp   PopMale  PopFemale
0      4          Afghanistan     0    0-4  2715.070   2600.535
1      8              Albania     0    0-4    92.622     81.239
2     12              Algeria     0    0-4  1966.415   1885.869
3     24               Angola     0    0-4  2233.041   2239.035
4     28  Antigua and Barbuda     0    0-4     3.543      3.436

In [22]:
all_pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 129549 entries, 0 to 129548
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   LocID      129549 non-null  int64
 1   Location   129549 non-null  object
 2   Year       129549 non-null  int64
 3   AgeGrp     129549 non-null  object
 4   PopMale    129549 non-null  float64
 5   PopFemale  129549 non-null  float64
dtypes: float64(2), int64(2), object(2)
memory usage: 5.9+ MB

In [23]:
# Example: Pivot so each row is AgeGrp+Time, columns are PopMale and PopFemale
pivot_df = all_pop.pivot_table(
    index=['AgeGrp', 'Year'], 
    values=['PopMale', 'PopFemale'],
    aggfunc='sum'  # or 'mean', or another aggregation if needed
)

pivot_df

               PopFemale      PopMale
AgeGrp Year
0-4    0     3198967.075  3416910.699
       2020   325430.019   346331.291
       2021   325707.611   346448.007
       2022   325787.889   346314.358
       2023   325721.798   345997.601
...                  ...          ...
95-99  2036     6024.352     2619.396
       2037     6478.888     2932.123
       2038     6876.470     3192.605
       2039     7022.010     3251.772
       2040     6746.216     2985.653

[462 rows x 2 columns]

In [24]:
all_pop_data = all_pop.melt(
    id_vars=[col for col in all_pop.columns if col not in ['PopMale', 'PopFemale']],
    value_vars=['PopMale', 'PopFemale'],
    var_name='Gender',
    value_name='Population'
)

all_pop_data

        LocID             Location  Year   AgeGrp     Gender  Population
0           4          Afghanistan     0      0-4    PopMale    2715.070
1           8              Albania     0      0-4    PopMale      92.622
2          12              Algeria     0      0-4    PopMale    1966.415
3          24               Angola     0      0-4    PopMale    2233.041
4          28  Antigua and Barbuda     0      0-4    PopMale       3.543
...       ...                  ...   ...      ...        ...         ...
259093    308              Grenada  2040  100-104  PopFemale       0.004
259094    426              Lesotho  2040  100-104  PopFemale       0.009
259095    516              Namibia  2040  100-104  PopFemale       0.003
259096    690           Seychelles  2040  100-104  PopFemale       0.007
259097    776                Tonga  2040  100-104  PopFemale       0.000

[259098 rows x 6 columns]

In [25]:
all_pop_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 259098 entries, 0 to 259097
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   LocID       259098 non-null  int64
 1   Location    259098 non-null  object
 2   Year        259098 non-null  int64
 3   AgeGrp      259098 non-null  object
 4   Gender      259098 non-null  object
 5   Population  259098 non-null  float64
dtypes: float64(1), int64(2), object(3)
memory usage: 11.9+ MB

In [26]:
all_pop_data['Gender'].replace({'PopMale': 'Male', 'PopFemale': 'Female'}, inplace=True)

C:\Users\sonal\AppData\Local\Temp\ipykernel_16840\292136993.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  all_pop_data['Gender'].replace({'PopMale': 'Male', 'PopFemale': 'Female'}, inplace=True)

In [27]:
all_pop_data

        LocID             Location  Year   AgeGrp  Gender  Population
0           4          Afghanistan     0      0-4    Male    2715.070
1           8              Albania     0      0-4    Male      92.622
2          12              Algeria     0      0-4    Male    1966.415
3          24               Angola     0      0-4    Male    2233.041
4          28  Antigua and Barbuda     0      0-4    Male       3.543
...       ...                  ...   ...      ...     ...         ...
259093    308              Grenada  2040  100-104  Female       0.004
259094    426              Lesotho  2040  100-104  Female       0.009
259095    516              Namibia  2040  100-104  Female       0.003
259096    690           Seychelles  2040  100-104  Female       0.007
259097    776                Tonga  2040  100-104  Female       0.000

[259098 rows x 6 columns]

In [28]:
all_pop_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 259098 entries, 0 to 259097
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   LocID       259098 non-null  int64
 1   Location    259098 non-null  object
 2   Year        259098 non-null  int64
 3   AgeGrp      259098 non-null  object
 4   Gender      259098 non-null  object
 5   Population  259098 non-null  float64
dtypes: float64(1), int64(2), object(3)
memory usage: 11.9+ MB

In [29]:
all_pop_data.isna().sum()

LocID         0
Location      0
Year          0
AgeGrp        0
Gender        0
Population    0
dtype: int64

In [30]:
all_pop_data.isnull().sum()

LocID         0
Location      0
Year          0
AgeGrp        0
Gender        0
Population    0
dtype: int64

In [31]:
from sklearn.preprocessing import MinMaxScaler

# normalize the population column using min-max scaling
scaler = MinMaxScaler()
all_pop_data['Population_norm'] = scaler.fit_transform(all_pop_data[['Population']])

# alternatively, z-score normalization could be added:
# all_pop_data['Population_zscore'] = (
#     all_pop_data['Population'] - all_pop_data['Population'].mean()
# ) / all_pop_data['Population'].std()

all_pop_data.head()

   LocID             Location  Year AgeGrp Gender  Population  Population_norm
0      4          Afghanistan     0    0-4   Male    2715.070         0.040207
1      8              Albania     0    0-4   Male      92.622         0.001372
2     12              Algeria     0    0-4   Male    1966.415         0.029120
3     24               Angola     0    0-4   Male    2233.041         0.033068
4     28  Antigua and Barbuda     0    0-4   Male       3.543         0.000052

In [32]:
all_pop_data.to_csv('./appended_dataset/population-2010-2039.csv',
                    index=False)